var a = [{
	url:"http://img31.mtime.cn/mt/2016/06/21/103126.35142042_270X360X4.jpg",
	des:"冲锋车案件主谋李家俊（彭于晏 饰）设计逃脱警方控制，与幕后黑手汇合，联手策划更大阴谋。而现警务处长刘杰辉（郭富城 饰），前警务副处长李文彬（梁家辉 饰），和资深大律师简奥伟（周润发 饰）被卷入其中，香港将面临更加大的危机……",
	movie_name:"寒战2",
	type:"24608",
	release_time:"2016:07:08",
	duration_time:"110"
},
{
	url:"http://img31.mtime.cn/mt/2016/06/24/110923.20327601_100X140X4.jpg",
	des:"所有活着的人类，都是海里一条巨大的鱼；出生的时候他们从海的此岸出发。他们的生命就像横越大海，有时相遇，有时分开……死的时候，他们便到了岸，各去各的世界。 　四十五亿年前，这个星球上，只有一片汪洋大海，和一群古老的大鱼。..",
	movie_name:"大鱼海棠",
	type:"2560",
	release_time:"2016:07:08",
	duration_time:"105"
},
{
	url:"http://img31.mtime.cn/mt/2016/07/08/102954.22891258_100X140X4.jpg",
	des:"《原来你还在这里》是一部讲述不同出身的青年男女在爱情上探索、迷失、错过但最终成长的故事。外表温柔安静的苏韵锦（刘亦菲饰）在高中同学程铮（吴亦凡饰）的深情追求下慢慢爱上了对方，可无奈相爱容易相处难，自小生活环境的差异以及..",
	movie_name:"致青春·原来你还在这里",
	type:"12288",
	release_time:"2016:07:08",
	duration_time:"97"
},
{
	url:"http://img31.mtime.cn/mt/2016/06/14/155308.87917738_100X140X4.jpg",
	des:"米开朗琪罗、多纳泰罗、莱昂纳多和拉斐尔将回归大银幕，与爱普尔·奥尼尔（梅根·福克斯饰）、弗恩·芬威克（威尔·阿奈特饰）和一位全新的角色－－曲棍球蒙面侠凯西·琼斯（斯蒂芬·阿梅尔饰）一起对付更强大、更邪恶的坏蛋。超级坏蛋..",
	movie_name:"忍者神龟2：破影而出",
	type:"50176",
	release_time:"2016:07:02",
	duration_time:"113"
},
{
	url:"http://img31.mtime.cn/mt/2016/07/05/101836.67105437_100X140X4.jpg",
	des:"藏獒波弟在山村长大，本该子承父业担当村庄卫士，却爱上了现代摇滚乐。为了追求音乐梦想，他进入城市，寻找乐队未果、拜师学艺受挫、屡遭狼群算计，但他坚持不懈，不仅拯救村民，还弥补了亲情上的裂痕，最终梦想成真。",
	movie_name:"摇滚藏獒",
	type:"16640",
	release_time:"2016:07:08",
	duration_time:"92"
},
{
	url:"http://img31.mtime.cn/mt/2016/06/15/104536.64708063_100X140X4.jpg",
	des:"在《惊天魔盗团》中，天启四骑士用幻术骗过FBI并赢得公众的崇拜。一年后，他们在续集《惊天魔盗团2》中卷土重来，却迎来了新敌人，这个敌人请他们去完成一次最危险的抢劫。",
	movie_name:"惊天魔盗团2",
	type:"49152",
	release_time:"2016:06:24",
	duration_time:"130"
},
{
	url:"http://img31.mtime.cn/mt/2016/07/05/100150.70132507_100X140X4.jpg",
	des:"电影《发条城市》讲述了三个性格迥异却情同手足的兄弟，在一家电影制作公司做道具师，老大宋戈（王自健），比猴还精，老二小风（王宁），单纯正直，老三阿正（修睿），幽默感性。三兄弟因财务纠纷与电影投资人的相好骄阳（王鸥）共同陷..",
	movie_name:"发条城市",
	type:"32768",
	release_time:"2016:07:08",
	duration_time:"113"
},
{
	url:"http://img31.mtime.cn/mt/2016/06/14/154831.64595502_100X150X4.jpg",
	des:"贵州黔东南神秘潮湿的亚热带乡土，大雾弥漫的凯里县城诊所里，两个医生心事重重活得像幽灵。陈升为了母亲的遗愿，踏上火车寻找弟弟抛弃的孩子；而另一位孤独的老女人托他带一张照片、一件衬衫、一盒磁带给病重的旧情人。去镇远县城的路..",
	movie_name:"路边野餐",
	type:"8200",
	release_time:"2016:08:15",
	duration_time:"113"
},
{
	url:"http://img31.mtime.cn/mt/2016/05/26/093634.91134694_100X150X4.jpg",
	des:"《超能太阳鸭》讲述了贪玩笨拙、不谙世事、滑稽逗趣的小鸭，通过一系列的冒险旅程努力追求梦想，最终完成自身使命的成长励志故事。",
	movie_name:"超能太阳鸭",
	type:"34816",
	release_time:"2016:08:15",
	duration_time:"81"
},
{
	url:"http://img31.mtime.cn/mt/2016/06/28/101910.21189254_100X150X4.jpg",
	des:"心理医生杨曦(郎月婷 饰演)在首尔进行学术交流期间，受华人郭志华(钟汉良 饰演)委托，接收了他因烧伤毁容的哥哥郭志达(钟汉良 饰演)进行创后心理诊疗辅导。 在治疗过程中，杨曦发现这个带着面具的郭志达似乎在密谋着一个危险的计划。于..",
	movie_name:"惊天大逆转",
	type:"16392",
	release_time:"2016:08:15",
	duration_time:"100"
},
{
	url:"http://img31.mtime.cn/mt/2016/06/13/092300.34033280_100X150X4.jpg",
	des:"19世纪80年代，泰山（亚历山大·斯卡斯加德饰）已经离开了刚果丛林十年了，他与心爱的简·波特（玛歌特·罗比饰）在维多利亚女王时代的英国伦敦生活。看似平静的城市生活对泰山来说并非真的自在，甚至感到窒息，身着考究的礼服，住在豪..",
	movie_name:"泰山归来：险战丛林",
	type:"17408",
	release_time:"2016:08:19",
	duration_time:"109"
},
{
	url:"http://img31.mtime.cn/mt/2016/07/11/093657.31840251_100X150X4.jpg",
	des:"《泡沫之夏》是女作家明晓溪的人气作品，该小说共有3部，主要讲述女主人公尹夏沫在音乐领域的经历与两位男主角欧辰、洛熙之间的爱情故事。深受广大言情小说迷的追捧，并先后改编成了漫画、电视剧。",
	movie_name:"泡沫之夏",
	type:"12288",
	release_time:"2016:08:21",
	duration_time:"100"
},
{
	url:"http://img31.mtime.cn/mt/2016/06/22/091248.97705558_100X150X4.jpg",
	des:"《巴霍巴利王：开端》改编自印度神话传说，讲述一名信仰湿婆的青年施瓦（Sivudu），从与世隔绝的瀑布下村落，一步一步攀爬至瀑布顶端，在新世界的冒险过程中逐渐发现自己身世，从而引出一段父辈巴霍巴利（Baahubali）与同襟兄弟巴哈拉..",
	movie_name:"巴霍巴利王：开端",
	type:"17408",
	release_time:"2016:08:22",
	duration_time:"128"
},
{
	url:"http://img31.mtime.cn/mt/2016/07/12/095643.82436001_100X150X4.jpg",
	des:"外星巨兽屁屁怪突然袭击地球大肆破坏，全球进入一级戒备，手足无措的军方决定向全球征集优秀的机器人设计，来对抗屁屁怪。梦想当发明家的麦兜，也带着他设计的“电饭宝”去参赛，机缘巧合下，竟然侥幸当选。于是地球的希望，一下子都落..",
	movie_name:"麦兜·饭宝奇兵",
	type:"34816",
	release_time:"20160822",
	duration_time:"90"
},
{
	url:"http://img31.mtime.cn/mt/2016/07/06/101031.51048454_100X150X4.jpg",
	des:"黑手党势力横行的亚特兰大阴云密布。现役警察、被警队除名的瘾君子、亡命匪徒组成的团伙受命于黑手党的蛇蝎美人头目（凯特·温丝莱特 饰），抢劫了市中心的金库却只为一个神秘保险箱。本以为可以借此金盆洗手的五人却被蛇蝎美人继续要..",
	movie_name:"红色警戒999",
	type:"160",
	release_time:"20160827",
	duration_time:"115"
}];


for (var i = 0, len = a.length; i < len; i++) {
	var movie = a[i];
	util.ajax({
		url: "/test/tx7",
		type:"POST",
		data: JSON.stringify(movie)
	});
}

var a = {
	user_name : "user2",
	password: "pass",
	email: "502442134@qq.com",
	phone_number: 18819473259
};
util.ajax({
	url: "/test/tx2",
	type:"POST",
	data: JSON.stringify(a)
});



var c = {
	cinema_name : "广州金逸珠江国际影城",
	address 	: "小谷街道贝岗村中二横路1号GOGO新天地商业广场",
	scores 		: [5, 5]
}
util.ajax({
	url: "/test/tx6",
	type:"POST",
	data: JSON.stringify(c)
});
